---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.Code
source: html/85ed78bc-9687-a07d-4d94-5748b16cb970.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.Code Property

The code of the button.

## Syntax (C#)
```csharp
public string Code { get; }
```